Applications/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.wscat.soen487/">
  <soapenv:Body>
    <ser:submitWSDLRepo>
      <!--Optional:-->
      <repoURI>http://data.serviceplatform.org/wsdl_grabbing/biocatalogue-wsdls/valid_WSDLs/</repoURI>
    </ser:submitWSDLRepo>
  </soapenv:Body>
</soapenv:Envelope>